cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'

brew 'ack'
brew 'ant'
brew 'ant-contrib'
brew 'antigen'
brew 'autojump'
brew 'cmake'
brew 'coreutils'
brew 'git'
brew 'macvim', args: ['override-system-vim', 'with-cscope', 'with-lua']
brew 'multimarkdown'
brew 'node'
brew 'node-build'
brew 'nodenv'
brew 'openssl'
brew 'plantuml'
brew 'postgresql'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'ruby-build'
brew 'sqlite'
brew 'tmux'
brew 'unrar'
brew 'wget'
cask '1password'
cask 'alfred'
cask 'atext'
cask 'cheatsheet'
cask 'crashplan'
cask 'dbeaver-enterprise'
cask 'dropbox'
cask 'firefox'
cask 'fluid'
cask 'font-inconsolata'
cask 'font-source-code-pro'
cask 'fromscratch'
cask 'google-chrome'
cask 'hammerspoon'
cask 'hipchat'
cask 'intellij-idea'
cask 'iterm2'
cask 'java'
cask 'karabiner'
cask 'keyboard-maestro'
cask 'kindle'
cask 'kindlegen'
cask 'nvalt'
cask 'seil'
cask 'send-to-kindle'
cask 'sketchup'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sql-power-architect-jdbc'
cask 'tower'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
mas 'Blackmagic Disk Speed Test', id: 425264550 
mas 'Compare Folders', id: 816042486 
mas 'DaisyDisk', id: 411643860 
mas 'Dash', id: 458034879 
mas 'Day One Classic', id: 422304217 
mas 'Disk Diag', id: 672206759 
mas 'Gemini', id: 463541543 
mas 'Keynote', id: 409183694 
mas 'Marked 2', id: 890031187 
mas 'MoneyWell', id: 404246493 
mas 'Numbers', id: 409203825 
mas 'Pages', id: 409201541 
mas 'Paprika Recipe Manager', id: 451907568 
mas 'Pixelmator', id: 407963104 
mas 'Pomodoro Timer', id: 872515009 
mas 'TaskPaper', id: 424281111 
mas 'iPulse', id: 1028916583 
mas 'Tadam', id: 531349534
