cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'
tap 'cloudfoundry/tap'

cask 'java'

brew 'ack'
brew 'ag'
brew 'antigen'
brew 'asdf'
brew 'autojump'
brew 'byobu'
brew 'cf-cli'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'direnv'
brew 'elixir'
brew 'elm'
brew 'fzf'
brew 'git'
brew 'git-flow'
brew 'go', args: ['cross-compile-common']
brew 'gpg'
brew 'jsonpp'
brew 'jq'
brew 'macvim', argc: ['with-override-system-vim']
brew 'multimarkdown'
brew 'neovim'
brew 'node'
brew 'node-build'
brew 'nodenv'
brew 'openssl'
brew 'plantuml'
brew 'postgresql'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby-build'
brew 'sqlite'
brew 'tmux'
brew 'unrar'
brew 'wget'
cask '1password'
cask 'alfred'
cask 'anki'
cask 'atext'
cask 'backblaze'
cask 'bibdesk'
cask 'caffeine'
cask 'carbon-copy-cloner'
cask 'cheatsheet'
cask 'choosy'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'fluid'
cask 'flycut'
cask 'font-inconsolata'
cask 'font-source-code-pro'
cask 'fromscratch'
cask 'google-chrome'
cask 'google-hangouts'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keyboard-maestro'
cask 'kindle'
cask 'kindlegen'
cask 'nvalt'
cask 'pgadmin4'
cask 'pharo-launcher'
cask 'postman'
cask 'racket'
cask 'sketchup'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'tower'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
mas 'Airmail 3', id: 918858936
mas 'Apple Configurator 2', id: 1037126344
mas 'Be Focused Pro - Focus Timer', id: 961632517
mas 'Bear', id: 1091189122
mas 'Blackmagic Disk Speed Test', id: 425264550 
mas 'Compare Folders', id: 816042486 
mas 'DaisyDisk', id: 411643860
mas 'Day One', id: 1055511498
mas 'Disk Diag', id: 672206759
mas 'Fantastical 2', id: 975937182
mas 'Gemini 2: The Duplicate Finder', id: 1090488118
mas 'Harvest', id: 506189836 
mas 'Keynote', id: 409183694 
mas 'Marked 2', id: 890031187 
mas 'Numbers', id: 409203825 
mas 'Pages', id: 409201541 
mas 'Paprika Recipe Manager', id: 451907568 
mas 'Pixelmator', id: 407963104 
mas 'iPulse', id: 1028916583 
mas 'Speedtest by Ookla', id: 1153157709
mas 'Tadam', id: 531349534
mas 'Tweetbot for Twitter', id: 557168941
